---
type: DisplayingOptionsDialogEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# DisplayingOptionsDialogEventArgs

`Autodesk.Revit.UI.Events.DisplayingOptionsDialogEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddTab | 2013 | `public void AddTab ( string newTabName , TabbedDialogExtension tabbedDialogExtension )` |
| Property | PagesCount | 2013 | `public int PagesCount { get ; }` |